In [1]:
import pandas as pd

In [3]:
df11 = pd.read_csv('demo123.csv')
df11

   vaibhav  akshay  tom  chris  johnny
0        1       2    3      4       5
1        8       6    4      2       9
2        1       0    2      6       3
3        1       4    7      9       2

In [7]:

df11['shahid'] = df11['vaibhav']+df11['akshay']
df11
df11.to_csv('abc',index=False)
df11

   vaibhav  akshay  tom  chris  johnny  shahid
0        1       2    3      4       5       3
1        8       6    4      2       9      14
2        1       0    2      6       3       1
3        1       4    7      9       2       5